/************************************************************************************
                  ** H **
Module: Модуль содержит определения платформ-независимых ключей функционала устройства.
Author: Unic-Lab <https://unic-lab.ru/>
************************************************************************************/

#define PRODUCT_ID							155
#define PRODUCT_VERSION						3

//===================================================================================

// отладочная сборка
#define BUILD_DEBUG_JLINK					0																			// ВЫКЛ. IWDG_APP, ВЫКЛ. RESET МК в hard_fauld, доступен J-LINK

// релизная сборка
#define BUILD_RELEASE_JLINK					0																			// ВКЛ. IWDG_APP, ВКЛ. RESET МК в hard_fauld, доступен J-LINK

// релизная сборка
#define BUILD_RELEASE_NO_JLINK				1																			// ВКЛ. IWDG_APP, ВКЛ. RESET МК в hard_fauld

//===================================================================================

// сборка ИТОГОВОЙ прошивки с [ВЫКЛ] LOG
#define BUILD_NO_LOG						1
// сборка ИТОГОВОЙ прошивки с [ВКЛ] LOG
#define BUILD_WITH_LOG						2
// сборка прошивки с подключением боковой панели на разъем нижнего актуатора в hard_1
#define BUILD_WITH_EMULATE_SIDE_PANEL		3

//===================================================================================

// текущая сборка
#define BUILT_TYPE							BUILD_NO_LOG
