/************************************************************************************
                  ** H **
Module: Модуль содержит определения платформ-зависимых ключей функционала устройства.
Author: Unic-Lab <https://unic-lab.ru/>
************************************************************************************/

#define PLAT_SCHEME_VERSION_MAJOR	1																					// версия схемы, первая часть (слева от точки)
#define PLAT_SCHEME_VERSION_MINOR	0																					// версия схемы, вторая часть (справа от точки)
#define PLAT_SCHEME_VARIANT			0																					// вариант исполнения (содержится в децимальном номере после дефиса)
